JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
/* NuttX port: the prologue below came from a wrapper translation unit
 * at wifi/hal_port/vendor_sources/rw_msg_rx.c, which existed only to include this
 * file.  The build lists this file directly now.
 */
#include <bk_prelude.h>

// Copyright 2020-2021 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <common/bk_include.h>
#include <os/mem.h>
#include <os/str.h>
#include "co_bit.h"
#include "bk_rw.h"
#if CONFIG_RWNX_SW_TXQ
#include "wifi_spinlock.h"
#include "skbuff.h"
#include "rwnx_tx.h"
#include "rwnx_txq.h"
#endif
#include "ieee802_11_defs.h"
#include "bk_wifi.h"
#include "driver.h"
#include "signal.h"
#include "ctrl_iface.h"
#include "rw_msg_rx.h"
#include "bk7258_scan_diag.h"
#include "rwnx_misc.h"

#include "wpa_ctrl.h"
#include "main_none.h"
#include "rwnx_defs.h"
#include "bk_hostapd_intf.h"
#include "bk_wifi_private.h"
#include <components/event.h>
#include <modules/wifi.h>
#include <components/netif.h>
#if CONFIG_TX_BUFING
#include "rw_tx_buffering.h"
#endif
#include "ieee802_11_common.h"
#include "bk_wifi_types.h"
#include "bk_wifi_prop_private.h"
#include "net.h"
#include "fhost_msg.h"
#include <modules/wifi_types.h>

uint32_t resultful_scan_cfm = 0;
uint8_t *ind_buf_ptr = 0;
struct co_list rw_msg_rx_head;
struct co_list rw_msg_tx_head;
wifi_linkstate_reason_t connect_flag = {WIFI_LINKSTATE_STA_IDLE, WIFI_REASON_MAX};
SCAN_RST_UPLOAD_T *scan_rst_set_ptr = 0;

IND_CALLBACK_T scan_cfm_cb_user = {0};
IND_CALLBACK_T wlan_connect_user_cb = {0};
rw_event_handler rw_event_handlers[WIFI_LINKSTATE_MAX] = {0};

beken_mutex_t sr_mutex;
uint32_t mac_ie_he_capa_find(uint32_t buffer, uint16_t buflen, uint8_t *ie_len);

wifi_rlk_base_info_t wifi_rlk_info = {0};

int roc_channel = 0;
/**
 ****************************************************************************************
 * Test whether the specified capability is supported locally
 * @param[in] type Capability type (HT, VHT or HE)
 * @return true if supported, false otherwise
 ****************************************************************************************
 */
#define LOCAL_CAPA(type) ((me_env_get_capa_flags() & ME_##type##_CAPA) != 0)

#if CONFIG_AP_PROBEREQ_CB
apvif_probereq_frame_t apvif_probereq_frame_cb = NULL;

void ap_vif_probe_req_frame_cb_register(apvif_probereq_frame_t cb)
{
	apvif_probereq_frame_cb = cb;
}

void ap_vif_probe_req_frame_cb_hander(unsigned char *data, unsigned int length)
{
	apvif_probereq_frame_t probereq_cb = apvif_probereq_frame_cb;

	if (probereq_cb) {
		uint8_t *mgnt_buf;
		mgnt_buf = wifi_malloc(length);
		if (mgnt_buf) {
			os_memcpy(mgnt_buf, (uint8_t *)data, length);
			probereq_cb(mgnt_buf, length);
			os_free(mgnt_buf);
		}
	}
}
#endif

extern FUNC_1PARAM_PTR bk_wlan_get_status_cb(void);
extern void app_set_sema(void);
extern int get_security_type_from_ie(u8 *, int, u16);
extern void rwnx_cal_set_txpwr(UINT32 pwr_gain, UINT32 grate);
extern void bk7011_default_rxsens_setting(void);

/* scan result malloc item */
UINT8 *sr_malloc_result_item(UINT32 vies_len)
{
#if CONFIG_PSRAM_AS_SYS_MEMORY
	#if CONFIG_MINIMUM_SCAN_RESULTS
	return psram_zalloc(vies_len + sizeof(struct wpa_scan_res));
	#else
	return psram_zalloc(vies_len + sizeof(struct sta_scan_res));
	#endif
#else
	#if CONFIG_MINIMUM_SCAN_RESULTS
	return os_zalloc(vies_len + sizeof(struct wpa_scan_res));
	#else
	return os_zalloc(vies_len + sizeof(struct sta_scan_res));
	#endif
#endif
}

/* free scan result item */
void sr_free_result_item(UINT8 *item_ptr)
{
	os_free(item_ptr);
}

UINT8 *sr_malloc_shell(void)
{
	UINT8 *ptr;
	UINT32 layer1_space_len;
	UINT32 layer2_space_len;

	layer1_space_len = sizeof(SCAN_RST_UPLOAD_T);
	#if CONFIG_MINIMUM_SCAN_RESULTS
	layer2_space_len = MAX_BSS_LIST * sizeof(struct wpa_scan_res *);
	#else
	layer2_space_len = MAX_BSS_LIST * sizeof(struct sta_scan_res *);
	#endif

	#if CONFIG_PSRAM_AS_SYS_MEMORY
	ptr = psram_zalloc(layer1_space_len + layer2_space_len);
	#else
	ptr = os_zalloc(layer1_space_len + layer2_space_len);
	#endif

	if (ptr)
		return ptr;
	else {
		RWNX_LOGD("sr_malloc fail \r\n");
		return 0;
	}
}

void sr_free_shell(UINT8 *shell_ptr)
{
	os_free(shell_ptr);
}

void sr_free_all(SCAN_RST_UPLOAD_T *scan_rst)
{
	UINT32 i;

	for (i = 0; i < scan_rst->scanu_num; i ++) {
		sr_free_result_item((UINT8 *)scan_rst->res[i]);
		scan_rst->res[i] = 0;
	}
	scan_rst->scanu_num = 0;
	scan_rst->ref = 0;

	sr_free_shell((UINT8 *)scan_rst);
}

uint32_t sr_get_scan_number(void)
{
	uint32_t count = 0;
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	if (scan_rst_set_ptr)
		count = scan_rst_set_ptr->scanu_num;
	GLOBAL_INT_RESTORE();

	return count;
}

/* Attention: sr_get_scan_results and sr_release_scan_results have to come in pairs*/
void *sr_get_scan_results(void)
{
	void *ptr;
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	ptr = scan_rst_set_ptr;
	if (ptr != NULL)
		scan_rst_set_ptr->ref += 1;
	GLOBAL_INT_RESTORE();

	return ptr;
}

void sr_flush_scan_results(void *rst_ptr)
{
	SCAN_RST_UPLOAD_PTR ptr = (SCAN_RST_UPLOAD_PTR)rst_ptr;
	//GLOBAL_INT_DECLARATION();

	//GLOBAL_INT_DISABLE();
	ptr->ref = 1;
	sr_release_scan_results(ptr);
	//GLOBAL_INT_RESTORE();
}

/* Attention: sr_get_scan_results and sr_release_scan_results have to come in pairs*/
void sr_release_scan_results(SCAN_RST_UPLOAD_PTR ptr)
{
	rtos_lock_mutex(&sr_mutex);
	if ((0 == ptr) || (0 == ptr->ref)) {
		RWNX_LOGD("released_scan_results\r\n");
		goto release_exit;
	}

	ptr->ref -= 1;

	if (ptr->ref) {
		RWNX_LOGD("release_scan_results later\r\n");
		goto release_exit;
	}

	if (ptr)
		sr_free_all(ptr);
	scan_rst_set_ptr = 0;
	resultful_scan_cfm = 0;

	wpa_clear_scan_results();

release_exit:
	rtos_unlock_mutex(&sr_mutex);
	return;

