JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
}

void mr_kmsg_init(void)
{
	co_list_init(&rw_msg_tx_head);
	co_list_init(&rw_msg_rx_head);
}

UINT32 mr_kmsg_fwd(struct ke_msg *msg)
{
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	co_list_push_back(&rw_msg_rx_head, &msg->hdr);
	GLOBAL_INT_RESTORE();

	app_set_sema();

	return 0;
}

void mr_kmsg_flush(void)
{
	while (mr_kmsg_fuzzy_handle())
		;
}

UINT32 mr_kmsg_fuzzy_handle(void)
{
	UINT32 ret = 0;
	struct ke_msg *msg;
	struct co_list_hdr *node;

	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	node = co_list_pop_front(&rw_msg_rx_head);
	GLOBAL_INT_RESTORE();

	if (node) {
		msg = (struct ke_msg *)node;
		ke_msg_free(msg);

		ret = 1;
	}

	return ret;
}

UINT32 mr_kmsg_exact_handle(UINT16 rsp)
{
	UINT32 ret = 0;
	struct ke_msg *msg;
	struct co_list_hdr *node;

	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	node = co_list_pop_front(&rw_msg_rx_head);
	GLOBAL_INT_RESTORE();

	if (node) {
		msg = (struct ke_msg *)node;
		if (rsp == msg->id)
			ret = 1;
		ke_msg_free(msg);
	}

	return ret;
}

void mhdr_connect_user_cb(FUNC_2PARAM_PTR ind_cb, void *ctxt)
{
	wlan_connect_user_cb.cb = ind_cb;
	wlan_connect_user_cb.ctxt_arg = ctxt;
}

/* depreciated, compatible with wifi api v1 */
static int scan_ap_cb_for_new_api(void *arg, event_module_t event_module,
								  int event_id, void *event_data)
{
	if (scan_cfm_cb_user.cb)
		scan_cfm_cb_user.cb(scan_cfm_cb_user.ctxt_arg, 0/* dummy */);

	return BK_OK;
}

/* depreciated, compatible with wifi api v1 */
void mhdr_scanu_reg_cb(FUNC_2PARAM_PTR ind_cb, void *ctxt)
{
	scan_cfm_cb_user.cb = ind_cb;
	scan_cfm_cb_user.ctxt_arg = ctxt;

	bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
						 scan_ap_cb_for_new_api, NULL);
}

#if CONFIG_WIFI_SCAN_COUNTRY_CODE
// Country code beacon received
static beken_thread_t g_scan_cc_thread = NULL;
static beken_semaphore_t cc_scan_handle = NULL;
bool site_survey_cc = false;

static int cc_scan_ap_cb(void *arg, event_module_t event_module,
						 int event_id, void *_event_data)
{
	uint32_t thread_id = (uint32_t)arg;
	wifi_event_scan_done_t *event_data = _event_data;

	// If EVENT_WIFI_SCAN_DONE event's scan_id equals our thread_id
	if (thread_id == event_data->scan_id) {
		if (cc_scan_handle)
			rtos_set_semaphore(&cc_scan_handle);
	}

	return BK_OK;
}

static void cc_scan_thread(beken_thread_arg_t arg)
{
	bk_err_t err = kNoErr;

	err = rtos_init_semaphore(&cc_scan_handle, 1);
	if (err == kNoErr) {
		int loop = 0;
		uint8 cfm;
		bk_event_register_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
							 cc_scan_ap_cb, rtos_get_current_thread());
		wifi_scan_config_t scan_param = {0};
		scan_param.ssid[0] = 0;
		scan_param.flag = SCAN_TYPE_CC;
		err = bk_wifi_scan_start(&scan_param);

		if(err == kNoErr){
			while((loop < 100)&&(g_scan_cc_thread)) {
				err = rtos_get_semaphore(&cc_scan_handle, 50);
				if(err == kNoErr) {
					break;
				} else if(err == kTimeoutErr) {
					loop ++;
					continue;
				}
			}
			if(g_scan_cc_thread == NULL)
			{
				rw_msg_send_scan_cancel_req(&cfm);
			}
		}
		bk_event_unregister_cb(EVENT_MOD_WIFI, EVENT_WIFI_SCAN_DONE,
							 cc_scan_ap_cb);
		if (cc_scan_handle)
			rtos_deinit_semaphore(&cc_scan_handle);
		cc_scan_handle = NULL;
	}

	g_scan_cc_thread = NULL;
	rtos_delete_thread(NULL);
}

int cc_scan_start(void)
{
	bk_err_t err = kNoErr;

	if(g_scan_cc_thread == NULL)
	{
		err = rtos_create_thread(&g_scan_cc_thread, BEKEN_APPLICATION_PRIORITY,
								"ccscan",
								(beken_thread_function_t)cc_scan_thread,
								0x800,
								(beken_thread_arg_t)0);
	}
	else
	{
		err = kInProgressErr;
	}

	return err;
}

void cc_scan_stop(void)
{
	if(g_scan_cc_thread)
	{
		GLOBAL_INT_DECLARATION();

		GLOBAL_INT_DISABLE();
		g_scan_cc_thread = NULL;
		GLOBAL_INT_RESTORE();

		while(cc_scan_handle)
			rtos_delay_milliseconds(50);
	}
}
#endif // CONFIG_WIFI_SCAN_COUNTRY_CODE

void mhdr_connect_ind(void *msg, UINT32 len)
{
	struct ke_msg *msg_ptr;
	struct sm_connect_ind *ind;

	msg_ptr = (struct ke_msg *)msg;
	ind = (struct sm_connect_ind *)msg_ptr->param;

	if (!ind->status_code) {
		RWNX_LOGV("connect ok\n");

		bk7011_default_rxsens_setting();

#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
		rwnx_misc_connect_ind(ind);
#endif

		if (wlan_connect_user_cb.cb)
			(*wlan_connect_user_cb.cb)(wlan_connect_user_cb.ctxt_arg, 0);
	} else
		RWNX_LOGV("connect fail\n");

	/* Send to wpa_supplicant */
	/* ind->assoc_ie_buf is a flexible array */
	wpa_ctrl_event_copy(WPA_CTRL_EVENT_CONNECT_IND, ind, macif_max_api_msg_len());
}

/* RXU_MGT_IND handler, send it to wpa_s */
void mhdr_mgmt_ind(void *msg, UINT32 len)
{
	struct ke_msg *msg_ptr = (struct ke_msg *)msg;
	struct rxu_mgt_ind *ind = (struct rxu_mgt_ind *)msg_ptr->param;

	wpa_ctrl_event_copy(WPA_CTRL_EVENT_MGMT_IND, ind, sizeof(*ind) + ind->length);
}

void mhdr_set_station_status(wifi_linkstate_reason_t info)
{
	GLOBAL_INT_DECLARATION();

	GLOBAL_INT_DISABLE();
	connect_flag.state = info.state;
	connect_flag.reason_code = info.reason_code;
	GLOBAL_INT_RESTORE();

#if (CONFIG_ALIOS)
	if (info.state == WIFI_LINKSTATE_STA_DISCONNECTED)
		connection_fail_cb(info);
#endif
}

wifi_linkstate_reason_t mhdr_get_station_status(void)
{
	return connect_flag;
}

bool mhdr_station_status_not_connected(void)
{
    wifi_linkstate_reason_t info = mhdr_get_station_status();

    return info.state < WIFI_LINKSTATE_STA_CONNECTED;
}

static void sort_scan_result(SCAN_RST_UPLOAD_T *ap_list)
{
	int i, j;
	#if CONFIG_MINIMUM_SCAN_RESULTS
	struct wpa_scan_res *tmp;
	#else
	struct sta_scan_res *tmp;
	#endif
	if (!ap_list)
		return;

	if (ap_list->scanu_num == 0)
		return;

	for (i = 0; i < (ap_list->scanu_num - 1); i++) {
		for (j = i + 1; j < ap_list->scanu_num; j++) {
			if (ap_list->res[j]->level > ap_list->res[i]->level) {
				tmp = ap_list->res[j];
				ap_list->res[j] = ap_list->res[i];
				ap_list->res[i] = tmp;
			}
		}
	}
}

#if CONFIG_RWNX_MULTIPLE_SSID_STA_MODE
/* find the match ie element */
const struct element *
rwnx_find_elem_match(u8 eid, const u8 *ies, unsigned int len,
			 const u8 *match, unsigned int match_len,
			 unsigned int match_offset)
{
	const struct element *elem;

	for_each_element_id(elem, eid, ies, len) {
		if (elem->datalen >= match_offset + match_len &&
		    !os_memcmp(elem->data + match_offset, match, match_len))
			return elem;
	}

