JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
	return NULL;
}

static inline const struct element *
rwnx_find_elem(u8 eid, const u8 *ies, int len)
{
	return rwnx_find_elem_match(eid, ies, len, NULL, 0, 0);
}

static const struct element
*rwnx_get_profile_continuation(const u8 *ie, size_t ielen,
										const struct element *mbssid_elem,
										const struct element *sub_elem)
{
	const u8 *mbssid_end = mbssid_elem->data + mbssid_elem->datalen;
	const struct element *next_mbssid;
	const struct element *next_sub;

	next_mbssid = rwnx_find_elem(WLAN_EID_MULTIPLE_BSSID, mbssid_end,
									ielen - (mbssid_end - ie));

	/*
	 * If it is not the last subelement in current MBSSID IE or there isn't
	 * a next MBSSID IE - profile is complete.
	*/
	if ((sub_elem->data + sub_elem->datalen < mbssid_end - 1) ||
	    !next_mbssid)
		return NULL;

	/* For any length error, just return NULL */

	if (next_mbssid->datalen < 4)
		return NULL;

	next_sub = (void *)&next_mbssid->data[1];

	if (next_mbssid->data + next_mbssid->datalen <
	    next_sub->data + next_sub->datalen)
		return NULL;

	if (next_sub->id != 0 || next_sub->datalen < 2)
		return NULL;

	/*
	 * Check if the first element in the next sub element is a start
	 * of a new profile
	 */
	return next_sub->data[0] == WLAN_EID_NONTRANSMITTED_BSSID_CAPA ?
	       NULL : next_mbssid;
}

/**
 * ether_addr_to_u64 - Convert an Ethernet address into a u64 value.
 * @addr: Pointer to a six-byte array containing the Ethernet address
 *
 * Return a u64 value of the address
 */
static inline u64 ether_addr_to_u64(const u8 *addr)
{
	u64 u = 0;
	int i;

	for (i = 0; i < ETH_ALEN; i++)
		u = u << 8 | addr[i];

	return u;
}

/**
 * u64_to_ether_addr - Convert a u64 to an Ethernet address.
 * @u: u64 to convert to an Ethernet MAC address
 * @addr: Pointer to a six-byte array to contain the Ethernet address
 */
static inline void u64_to_ether_addr(u64 u, u8 *addr)
{
	int i;

	for (i = ETH_ALEN - 1; i >= 0; i--) {
		addr[i] = u & 0xff;
		u = u >> 8;
	}
}

/**
 * cfg80211_gen_new_bssid - generate a nontransmitted BSSID for multi-BSSID
 * @bssid: transmitter BSSID
 * @max_bssid: max BSSID indicator, taken from Multiple BSSID element
 * @mbssid_index: BSSID index, taken from Multiple BSSID index element
 * @new_bssid: calculated nontransmitted BSSID
 */
static inline void rwnx_gen_new_bssid(const u8 *bssid, u8 max_bssid,
					                       u8 mbssid_index, u8 *new_bssid)
{
	u64 bssid_u64 = ether_addr_to_u64(bssid);
	u64 mask = GENMASK_ULL(max_bssid - 1, 0);
	u64 new_bssid_u64;

	new_bssid_u64 = bssid_u64 & ~mask;
	new_bssid_u64 |= ((bssid_u64 & mask) + mbssid_index) & mask;
	u64_to_ether_addr(new_bssid_u64, new_bssid);
}

/* element is non_inherit_elem or not */
bool rwnx_is_element_inherited(const struct element *elem,
				               const struct element *non_inherit_elem)
{
	u8 id_len, ext_id_len, i, loop_len, id;
	const u8 *list;

	if (elem->id == WLAN_EID_MULTIPLE_BSSID)
		return false;

	if (!non_inherit_elem || non_inherit_elem->datalen < 2)
		return true;

	/*
	 * non inheritance element format is:
	 * ext ID (56) | IDs list len | list | extension IDs list len | list
	 * Both lists are optional. Both lengths are mandatory.
	 * This means valid length is:
	 * elem_len = 1 (extension ID) + 2 (list len fields) + list lengths
	 */
	id_len = non_inherit_elem->data[1];
	if (non_inherit_elem->datalen < 3 + id_len)
		return true;

	ext_id_len = non_inherit_elem->data[2 + id_len];
	if (non_inherit_elem->datalen < 3 + id_len + ext_id_len)
		return true;

	if (elem->id == WLAN_EID_EXTENSION) {
		if (!ext_id_len)
			return true;
		loop_len = ext_id_len;
		list = &non_inherit_elem->data[3 + id_len];
		id = elem->data[0];
	} else {
		if (!id_len)
			return true;
		loop_len = id_len;
		list = &non_inherit_elem->data[2];
		id = elem->id;
	}

	for (i = 0; i < loop_len; i++) {
		if (list[i] == id)
			return false;
	}

	return true;
}

/* find the match ie */
static inline const u8 *
rwnx_find_ie_match(u8 eid, const u8 *ies, unsigned int len,
		           const u8 *match, unsigned int match_len,
		           unsigned int match_offset)
{
	return (void *)rwnx_find_elem_match(eid, ies, len,
						                match, match_len,
						                match_offset ?
					                    match_offset - 2 : 0);
}

/* find the match ie */
static inline const u8 *rwnx_find_ie(u8 eid, const u8 *ies, int len)
{
	return rwnx_find_ie_match(eid, ies, len, NULL, 0, 0);
}


/* find the match ext ie */
static inline const u8 *rwnx_find_ext_ie(u8 ext_eid, const u8 *ies, int len)
{
	return rwnx_find_ie_match(WLAN_EID_EXTENSION, ies, len, &ext_eid, 1, 2);
}

/* find the match ext element */
static inline const struct element *
rwnx_find_ext_elem(u8 ext_eid, const u8 *ies, int len)
{
	return rwnx_find_elem_match(WLAN_EID_EXTENSION, ies, len,
					            &ext_eid, 1, 0);
}

/* generate new ie */
static size_t rwnx_gen_new_ie(const u8 *ie, size_t ielen,
                              const u8 *subelement, size_t subie_len, u8 *new_ie)
{
	u8 *pos, *tmp;
	const u8 *tmp_old, *tmp_new;
	const struct element *non_inherit_elem;
	u8 *sub_copy;

	/* copy subelement as we need to change its content to
	 * mark an ie after it is processed.
	 */
    sub_copy = os_zalloc(subie_len);
	if (!sub_copy)
		return 0;

    os_memcpy(sub_copy, subelement, subie_len);
	pos = &new_ie[0];

	/* set new ssid save the ssid in profile */
    tmp_new = rwnx_find_ie(WLAN_EID_SSID, sub_copy, subie_len);
	if (tmp_new) {
		os_memcpy(pos, tmp_new, tmp_new[1] + 2);
		pos += (tmp_new[1] + 2);
	}

	/* get non inheritance list if exists */
	non_inherit_elem = rwnx_find_ext_elem(WLAN_EID_EXT_NON_INHERITANCE,
				                          sub_copy, subie_len);

	/* go through IEs in ie (skip SSID) and subelement,
	 * merge them into new_ie
	 */
	tmp_old = rwnx_find_ie(WLAN_EID_SSID, ie, ielen);
	tmp_old = (tmp_old) ? tmp_old + tmp_old[1] + 2 : ie;

	while (tmp_old + tmp_old[1] + 2 - ie <= ielen) {
		if (tmp_old[0] == 0) {
			tmp_old++;
			continue;
		}

		if (tmp_old[0] == WLAN_EID_EXTENSION)
			tmp = (u8 *)rwnx_find_ext_ie(tmp_old[2], sub_copy, subie_len);
		else
            tmp = (u8 *)rwnx_find_ie(tmp_old[0], sub_copy,
                                         subie_len);

