JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
		if (!tmp) {
			const struct element *old_elem = (void *)tmp_old;

			/* ie in old ie but not in subelement */
			if (rwnx_is_element_inherited(old_elem, non_inherit_elem)) {
				os_memcpy(pos, tmp_old, tmp_old[1] + 2);
				pos += tmp_old[1] + 2;
			}
		} else {
			/* ie in transmitting ie also in subelement,
			 * copy from subelement and flag the ie in subelement
			 * as copied (by setting eid field to WLAN_EID_SSID,
			 * which is skipped anyway).
			 * For vendor ie, compare OUI + type + subType to
			 * determine if they are the same ie.
			 */
			if (tmp_old[0] == WLAN_EID_VENDOR_SPECIFIC) {
				if (!os_memcmp(tmp_old + 2, tmp + 2, 5)) {
					/* same vendor ie, copy from
					 * subelement
					 */
					os_memcpy(pos, tmp, tmp[1] + 2);
					pos += tmp[1] + 2;
					tmp[0] = WLAN_EID_SSID;
				} else {
					os_memcpy(pos, tmp_old, tmp_old[1] + 2);
					pos += tmp_old[1] + 2;
				}
			} else {
				/* copy ie from subelement into new ie */
				os_memcpy(pos, tmp, tmp[1] + 2);
				pos += tmp[1] + 2;
				tmp[0] = WLAN_EID_SSID;
			}
		}

		if (tmp_old + tmp_old[1] + 2 - ie == ielen)
			break;

		tmp_old += tmp_old[1] + 2;
	}

	/* go through subelement again to check if there is any ie not
	 * copied to new ie, skip ssid, capability, bssid-index ie
	 */
	tmp_new = sub_copy;
	while (tmp_new + tmp_new[1] + 2 - sub_copy <= subie_len) {
		if (!(tmp_new[0] == WLAN_EID_NONTRANSMITTED_BSSID_CAPA ||
		      tmp_new[0] == WLAN_EID_SSID)) {
			os_memcpy(pos, tmp_new, tmp_new[1] + 2);
			pos += tmp_new[1] + 2;
		}
		if (tmp_new + tmp_new[1] + 2 - sub_copy == subie_len)
			break;
		tmp_new += tmp_new[1] + 2;
	}

	free(sub_copy);
	return pos - new_ie;
}

/* merge subdata into profile(for example EID 0;EID 83;EID 85) */
size_t rwnx_merge_profile(const u8 *ie, size_t ielen,
			              const struct element *mbssid_elem,
			              const struct element *sub_elem,
			              u8 *merged_ie, size_t max_copy_len)
{
	size_t copied_len = sub_elem->datalen;
	const struct element *next_mbssid;

	if (sub_elem->datalen > max_copy_len)
		return 0;

	os_memcpy(merged_ie, sub_elem->data, sub_elem->datalen);

	while ((next_mbssid = rwnx_get_profile_continuation(ie, ielen, mbssid_elem, sub_elem))) {
		    const struct element *next_sub = (void *)&next_mbssid->data[1];

		    if (copied_len + next_sub->datalen > max_copy_len)
			    break;
		    os_memcpy(merged_ie + copied_len, next_sub->data,
		              next_sub->datalen);
		    copied_len += next_sub->datalen;
	}

	return copied_len;
}

static int rwnx_inform_single_bss_data(SCAN_RST_UPLOAD_PTR result_ptr, SCAN_RST_ITEM_PTR item)
{
	int replace_index = -1, ret = BK_OK, i;
	/* check the duplicate bssid*/
	do {
		for (i = 0; i < result_ptr->scanu_num; i ++) {
			if (!os_memcmp(item->bssid, result_ptr->res[i]->bssid, ETH_ALEN)) {
				if ((result_ptr->res[i]->on_channel == 1) || (item->on_channel == 0)) {
					ret = BK_FAIL;
					os_free(item);
					goto scan_rst_exit;
				}
				else {
					replace_index = i; // should replace it.
				}
			}
		}
	} while (0);

	if (replace_index >= 0) {
		sr_free_result_item((UINT8 *)result_ptr->res[replace_index]);
		result_ptr->res[replace_index] = item;
#if CONFIG_RWNX_MULTIPLE_SSID_STA_MODE
	} else if (result_ptr->scanu_num < MAX_BSS_LIST) {
			result_ptr->res[result_ptr->scanu_num] = item;
			result_ptr->scanu_num ++;
#else
	} else {
		result_ptr->res[result_ptr->scanu_num] = item;
		result_ptr->scanu_num ++;
#endif
	}
scan_rst_exit:
	return ret;
}

/* process each multiple ssid element data and generate new_ie */
static void rwnx_inform_multiple_bss_data(SCAN_RST_UPLOAD_PTR result_ptr, SCAN_RST_ITEM_PTR item,
											UINT8 * var_part_addr, UINT32 vies_len)
{
	UINT8 *profile;
	UINT8 *new_ie;
	size_t new_ie_len;
	const struct element *elem;
	const struct element *sub;
	const u8 *mbssid_index_ie;
	u8 new_bssid[ETH_ALEN];
	u16 capability;
	SCAN_RST_ITEM_PTR multiple_item;

	if (!rwnx_find_ie(WLAN_EID_MULTIPLE_BSSID, var_part_addr, vies_len))
		return;

	/* alloc buffer for generate new ie */
	new_ie = (UINT8*)os_zalloc(vies_len);
	if (!new_ie)
		return;

	profile = (UINT8*)os_zalloc(vies_len);
	if (!profile)
		goto out;

	for_each_element_id(elem, WLAN_EID_MULTIPLE_BSSID, var_part_addr, vies_len) {
		if (elem->datalen < 4)
			continue;
		for_each_element(sub, elem->data + 1, elem->datalen - 1) {

			u8 profile_len;

			if (sub->id != 0 || sub->datalen < 4) {
				/* not a valid BSS profile */
				continue;
			}
			/* first sub_data[0] EID = 83 */
			if (sub->data[0] != WLAN_EID_NONTRANSMITTED_BSSID_CAPA ||
				sub->data[1] != 2) {
				/* The first element within the Nontransmitted
				* BSSID Profile is not the Nontransmitted
				* BSSID Capability element.
				*/
				continue;
			}

			/* merge the subdata into profile(EID 83- EID 85) */
			os_memset(profile, 0, vies_len);
			profile_len = rwnx_merge_profile(var_part_addr, vies_len, elem,
                                                 sub, profile, vies_len);

			/* found a Nontransmitted BSSID Profile EID = 85 */
			mbssid_index_ie = rwnx_find_ie(WLAN_EID_MULTIPLE_BSSID_INDEX, profile, profile_len);

			/* mbssid_index_ie[2]= BSS index, related to the maxbssid indicator */
			if (!mbssid_index_ie || mbssid_index_ie[1] < 1 ||
				mbssid_index_ie[2] == 0 ||
				mbssid_index_ie[2] > 46) {
				/* No valid Multiple BSSID-Index element */
				continue;
			}

			//save the bssid_idx and max_bssid_indicator of each multiple ssid element
			u8 bssid_index = mbssid_index_ie[2];
			u8 max_bssid_indicator = elem->data[0];

			/* new multiple ssid ie to be upload */
			multiple_item = (SCAN_RST_ITEM_PTR)sr_malloc_result_item(vies_len);
			multiple_item->on_channel = item->on_channel;
			multiple_item->channel = item->channel;
			multiple_item->beacon_int = item->beacon_int;
			multiple_item->level = item->level;
			multiple_item->security = item->security;
#if CONFIG_MINIMUM_SCAN_RESULTS
			multiple_item->tsf = item->tsf;
#else
			os_memcpy(multiple_item->tsf, item->tsf, 8);
#endif

