JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
			//generate new bssid and update the bss_id in ie_info
			rwnx_gen_new_bssid(item->bssid, max_bssid_indicator, bssid_index, new_bssid);
			os_memcpy(multiple_item->bssid, new_bssid, ETH_ALEN);

			//clean the new_ie buffer
			os_memset(new_ie, 0, vies_len);

			/* set the new SSID,
			go through IEs in ie (skip old SSID) and subelement, merge them into new_ie */
			new_ie_len = rwnx_gen_new_ie(var_part_addr, vies_len,
			                                  profile, profile_len, new_ie);
			if (!new_ie_len)
				continue;
			//save the nontransmitted capability for bssid_idx
			capability = co_read16(profile + 2);

			//save the new_ie_info into struct ie_info
			multiple_item->caps = capability;

			const uint8_t *elmt_addr = rwnx_find_ie(WLAN_EID_SSID, new_ie, new_ie_len);

			if (elmt_addr)
				os_memcpy(multiple_item->ssid, elmt_addr + 2, *(elmt_addr + 1));

			multiple_item->ie_len = new_ie_len;

			//upload the payload to the upper
			os_memcpy(multiple_item + 1, new_ie, new_ie_len);

			/* upload the single infor to the upper */
			rwnx_inform_single_bss_data(result_ptr, multiple_item);
		}
	}

out:
	os_free(new_ie);
	os_free(profile);
}
#endif

UINT32 mhdr_scanu_result_ind(SCAN_RST_UPLOAD_T *scan_rst, void *msg, UINT32 len)
{
	UINT32 ret, chann;
	UINT8 *elmt_addr;
	UINT32 vies_len;
	UINT8 *var_part_addr;
	struct ke_msg *msg_ptr;
	SCAN_RST_ITEM_PTR item;
	SCAN_RST_UPLOAD_PTR result_ptr;
	SCAN_IND_PTR scanu_ret_ptr;
	IEEE802_11_PROBE_RSP_PTR probe_rsp_ieee80211_ptr;
	char on_channel;
	#if CONFIG_RWNX_MULTIPLE_SSID_STA_MODE
	int infor_state;
	#else
	int replace_index = -1;
	UINT32 i;
	#endif

	ret = BK_OK;
	result_ptr = scan_rst;
	bk7258_scan_diag_record(BK7258_SCAN_DIAG_LMAC_RESULT_IND);

	msg_ptr = (struct ke_msg *)msg;
	scanu_ret_ptr = (SCAN_IND_PTR)msg_ptr->param;
	probe_rsp_ieee80211_ptr = (IEEE802_11_PROBE_RSP_PTR)scanu_ret_ptr->payload;
	vies_len = scanu_ret_ptr->length - MAC_BEACON_VARIABLE_PART_OFT;
	var_part_addr = probe_rsp_ieee80211_ptr->rsp.variable;
	#if CONFIG_WIFI_SCAN_COUNTRY_CODE
	if (site_survey_cc) {
		elmt_addr = (UINT8 *)get_ie(var_part_addr, vies_len, MAC_ELTID_COUNTRY);
		if (elmt_addr) {
			UINT8 cc_len = *(elmt_addr + MAC_COUNTRY_LEN_OFT);
			bk_wifi_bcn_cc_rxed_cb((uint8_t *)(elmt_addr + MAC_COUNTRY_STRING_OFT), cc_len);
		}
	}
	#endif // CONFIG_WIFI_SCAN_COUNTRY_CODE

	if (result_ptr->scanu_num >= MAX_BSS_LIST) {
		bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_TABLE_FULL);
		goto scan_rst_exit;
	}

	elmt_addr = (UINT8 *)get_ie(var_part_addr, vies_len, MAC_ELTID_DS);
	if (elmt_addr) { // adjust channel
		chann = *(elmt_addr + MAC_DS_CHANNEL_OFT);
		if (rw_ieee80211_is_scan_rst_in_countrycode(chann) == 0) {
			bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_COUNTRY_DROP);
			elmt_addr = (UINT8 *)get_ie(var_part_addr, vies_len, WLAN_EID_SSID);
			if (elmt_addr) {
				UINT8 ssid_b[MAC_SSID_LEN];
				UINT8 ssid_len = *(elmt_addr + 1);

				if (ssid_len > MAC_SSID_LEN)
					ssid_len = MAC_SSID_LEN;

				os_memcpy(ssid_b, elmt_addr + 2, ssid_len);
				RWNX_LOGD("drop: %s, chan:%d\r\n", ssid_b, chann);
			}

			goto scan_rst_exit;
		}

		if (chann == rw_ieee80211_get_chan_id(scanu_ret_ptr->center_freq))
			on_channel = 1;
		else
			on_channel = 0;
	} else {
        uint8_t elmt_length;
        elmt_addr = (UINT8 *)mac_ie_he_capa_find((UINT32)var_part_addr, vies_len, &elmt_length);
        if (elmt_addr && (LOCAL_CAPA(HE)))
        {
            RWNX_LOGD("he+he,scan rst no ds param, not drop it?\r\n");
            chann = rw_ieee80211_get_chan_id(scanu_ret_ptr->center_freq);
			if (rw_ieee80211_is_scan_rst_in_countrycode(chann) == 0)
			{
				bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_COUNTRY_DROP);
                elmt_addr = (UINT8 *)get_ie(var_part_addr, vies_len, WLAN_EID_SSID);
                if (elmt_addr)
                {
                    UINT8 ssid_b[MAC_SSID_LEN];
                    UINT8 ssid_len = *(elmt_addr + 1);

                    if (ssid_len > MAC_SSID_LEN)
                        ssid_len = MAC_SSID_LEN;

                    os_memcpy(ssid_b, elmt_addr + 2, ssid_len);
                    RWNX_LOGD("drop: %s, chan:%d\r\n", ssid_b, chann);
                }
                goto scan_rst_exit;
            }
            on_channel = 1;
        }
        else
        {
            chann = rw_ieee80211_get_chan_id(scanu_ret_ptr->center_freq);
            on_channel = 0;
            RWNX_LOGD("scan rst no ds param, drop it?\r\n");
        }
    }

#if !CONFIG_RWNX_MULTIPLE_SSID_STA_MODE
	/* check the duplicate bssid*/
	do {
		for (i = 0; i < result_ptr->scanu_num; i ++) {
			if (!os_memcmp(probe_rsp_ieee80211_ptr->bssid, result_ptr->res[i]->bssid, ETH_ALEN)) {
				if ((result_ptr->res[i]->on_channel == 1) || (on_channel == 0)) {
					bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_DUPLICATE);
					if (on_channel == 1)
						result_ptr->res[i]->level = ((result_ptr->res[i]->level + scanu_ret_ptr->rssi)>>1);
					goto scan_rst_exit;
				} else {
					replace_index = i; // should replace it.
				}
			}
		}
	} while (0);
#endif

	item = (SCAN_RST_ITEM_PTR)sr_malloc_result_item(vies_len);
	if (item == NULL) {
		bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_ALLOC_FAIL);
		goto scan_rst_exit;
	}

	elmt_addr = (UINT8 *)get_ie(var_part_addr, vies_len, WLAN_EID_SSID);
	if (elmt_addr) {
		UINT8 ssid_len = *(elmt_addr + 1);

		if (ssid_len > MAC_SSID_LEN)
			ssid_len = MAC_SSID_LEN;

		os_memcpy(item->ssid, elmt_addr + 2, ssid_len);
	} else {
		RWNX_LOGD("No ssid\r\n");
	}


	item->channel = chann;
	item->beacon_int = probe_rsp_ieee80211_ptr->rsp.beacon_int;
	item->caps = probe_rsp_ieee80211_ptr->rsp.capab_info;
	item->level = scanu_ret_ptr->rssi;
	item->on_channel = on_channel;
	item->ie_len = vies_len;
	item->security = get_security_type_from_ie((u8 *)var_part_addr, vies_len, item->caps);
	os_memcpy(item->bssid, probe_rsp_ieee80211_ptr->bssid, ETH_ALEN);
	#if CONFIG_MINIMUM_SCAN_RESULTS
	item->tsf = probe_rsp_ieee80211_ptr->rsp.timestamp;
	#else
	os_memcpy(item->tsf, probe_rsp_ieee80211_ptr->rsp.timestamp, 8);
	#endif
	os_memcpy(item + 1, var_part_addr, vies_len);
#if CONFIG_RWNX_MULTIPLE_SSID_STA_MODE
	/* upload single transmit-bss infor to upper */
	infor_state = rwnx_inform_single_bss_data(result_ptr, item);
	if(infor_state == BK_FAIL)
		goto scan_rst_exit;
	bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_INSERTED);

	/* check multiple nontransmit-bss and upload multiple bss infor to upper*/
	const u8 *multiple_ssid_required = rwnx_find_ie(WLAN_EID_MULTIPLE_BSSID, var_part_addr, vies_len);
	if (multiple_ssid_required) {
		rwnx_inform_multiple_bss_data(result_ptr, item, var_part_addr, vies_len);
	}
#else
	if (replace_index >= 0) {
		sr_free_result_item((UINT8 *)result_ptr->res[replace_index]);
		result_ptr->res[replace_index] = item;
	} else {
		result_ptr->res[result_ptr->scanu_num] = item;
		result_ptr->scanu_num ++;
	}
	bk7258_scan_diag_record(BK7258_SCAN_DIAG_RESULT_INSERTED);
#endif

scan_rst_exit:
	return ret;
}

