JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
#if CONFIG_RWNX_SW_TXQ

/******************************************************************************
 * Power Save functions
 *****************************************************************************/
/**
 * rwnx_set_traffic_status - Inform FW if traffic is available for STA in PS
 *
 * @rwnx_hw: Driver main data
 * @sta: Sta in PS mode
 * @available: whether traffic is buffered for the STA
 * @ps_id: type of PS data requested (@LEGACY_PS_ID or @UAPSD_ID)
  */
void rwnx_set_traffic_status(STA_INF_PTR sta, bool available, u8 ps_id)
{
	bool uapsd = (ps_id != LEGACY_PS_ID);
	rw_send_me_traffic_ind(mac_sta_mgmt_get_staid(sta), uapsd, available);
	// trace_ps_traffic_update(sta->sta_idx, available, uapsd);
}

/**
 * rwnx_ps_bh_enable - Enable/disable PS mode for one STA
 *
 * @rwnx_hw: Driver main data
 * @sta: Sta which enters/leaves PS mode
 * @enable: PS mode status
 *
 * This function will enable/disable PS mode for one STA.
 * When enabling PS mode:
 *  - Stop all STA's txq for RWNX_TXQ_STOP_STA_PS reason
 *  - Count how many buffers are already ready for this STA
 *  - For BC/MC sta, update all queued SKB to use hw_queue BCMC
 *  - Update TIM if some packet are ready
 *
 * When disabling PS mode:
 *  - Start all STA's txq for RWNX_TXQ_STOP_STA_PS reason
 *  - For BC/MC sta, update all queued SKB to use hw_queue AC_BE
 *  - Update TIM if some packet are ready (otherwise fw will not update TIM
 *    in beacon for this STA)
 *
 * All counter/skb updates are protected from TX path by taking tx_lock
 *
 * NOTE: _bh_ in function name indicates that this function is called
 * from a bottom_half tasklet.
 */
void rwnx_ps_bh_enable(STA_INF_PTR sta, bool enable)
{
	struct rwnx_txq *txq;
	struct rwnx_hw *rwnx_hw = &g_rwnx_hw;
	struct rwnx_sta_ps *ps = sta_mgmt_get_sta_ps(sta);


	if (enable) {
		// trace_ps_enable(sta);

		spin_lock(&rwnx_hw->tx_lock);
		ps->active = true;
		ps->sp_cnt[LEGACY_PS_ID] = 0;
		ps->sp_cnt[UAPSD_ID] = 0;
		rwnx_txq_sta_stop(sta, RWNX_TXQ_STOP_STA_PS);

		if (is_multicast_sta(mac_sta_mgmt_get_staid(sta))) {
			txq = rwnx_txq_sta_get(sta, 0);
			ps->pkt_ready[LEGACY_PS_ID] = skb_queue_len(&txq->sk_list);
			ps->pkt_ready[UAPSD_ID] = 0;
			txq->hwq = &rwnx_hw->hwq[RWNX_HWQ_BCMC];
		} else {
			int i;
			ps->pkt_ready[LEGACY_PS_ID] = 0;
			ps->pkt_ready[UAPSD_ID] = 0;
			foreach_sta_txq(sta, txq, i) {
				ps->pkt_ready[txq->ps_id] += skb_queue_len(&txq->sk_list);
			}
		}

		spin_unlock(&rwnx_hw->tx_lock);

		if (ps->pkt_ready[LEGACY_PS_ID])
			rwnx_set_traffic_status(sta, true, LEGACY_PS_ID);

		if (ps->pkt_ready[UAPSD_ID])
			rwnx_set_traffic_status(sta, true, UAPSD_ID);
	} else {
		// trace_ps_disable(mac_sta_mgmt_get_staid(sta));

		spin_lock(&rwnx_hw->tx_lock);
		ps->active = false;

		if (is_multicast_sta(mac_sta_mgmt_get_staid(sta))) {
			txq = rwnx_txq_sta_get(sta, 0);
			txq->hwq = &rwnx_hw->hwq[RWNX_HWQ_BE];
		}

		rwnx_txq_sta_start(sta, RWNX_TXQ_STOP_STA_PS);
		spin_unlock(&rwnx_hw->tx_lock);

		if (ps->pkt_ready[LEGACY_PS_ID])
			rwnx_set_traffic_status(sta, false, LEGACY_PS_ID);

		if (ps->pkt_ready[UAPSD_ID])
			rwnx_set_traffic_status(sta, false, UAPSD_ID);
	}
}


static inline int rwnx_rx_ps_change_ind(struct ke_msg *msg)
{
	struct mm_ps_change_ind *ind = (struct mm_ps_change_ind *)msg->param;
	STA_INF_PTR sta = NULL;
	GLOBAL_INT_DECLARATION();

	// RWNX_DBG(RWNX_FN_ENTRY_STR);
	GLOBAL_INT_DISABLE();
	if (ind->sta_idx >= (NX_REMOTE_STA_MAX + NX_VIRT_DEV_MAX)) {
		RWNX_LOGE("Invalid sta index reported by fw %d\n",
				  ind->sta_idx);
		GLOBAL_INT_RESTORE();
		return 1;
	}

	sta = sta_mgmt_get_entry(ind->sta_idx);

	//BK_LOGD(NULL,"Sta %d, change PS mode to %s\n", ind->sta_idx,
	//		  ind->ps_state ? "ON" : "OFF");

	// sta->mac_addr.array[0] == 0x1 means BCMC virtual sta.
	if (sta_mgmt_get_valid(sta) || sta_mgmt_get_mac(sta)[0] == 0x1) {
		rwnx_ps_bh_enable(sta, ind->ps_state);
#if 0
	} else if (test_bit(RWNX_DEV_ADDING_STA, &rwnx_hw->flags)) {
		sta->ps.active = ind->ps_state ? true : false;
#endif
	} else {
		RWNX_LOGW("Ignore PS mode change on invalid sta %d\n", ind->sta_idx);
	}
	GLOBAL_INT_RESTORE();

	return 0;
}
#endif // CONFIG_RWNX_SW_TXQ

#if CONFIG_RWNX_SW_TXQ
static int rwnx_rx_p2p_vif_ps_change_ind(struct ke_msg *msg)
{
	int vif_idx  = ((struct mm_p2p_vif_ps_change_ind *)msg->param)->vif_index;
	int ps_state = ((struct mm_p2p_vif_ps_change_ind *)msg->param)->ps_state;
	void *vif_entry = NULL;
	GLOBAL_INT_DECLARATION();

	// RWNX_DBG(RWNX_FN_ENTRY_STR);

	GLOBAL_INT_DISABLE();

	if (vif_idx != INVALID_VIF_IDX)
		vif_entry = mac_vif_mgmt_get_entry(vif_idx);


	if (!vif_entry || !mac_vif_mgmt_get_active(vif_entry)) {
		GLOBAL_INT_RESTORE();
		return 1;
	}

	if (ps_state == 0 /* MM_PS_MODE_OFF */) {
		// Start TX queues for provided VIF
		RWNX_LOGV("p2p start txq ps_state  %d\r\n", ps_state);
		rwnx_txq_vif_start(vif_entry, RWNX_TXQ_STOP_P2P_ABSENCE);
	} else {
		// Stop TX queues for provided VIF
		RWNX_LOGV("p2p stop txq ps_state  %d\r\n", ps_state);
		rwnx_txq_vif_stop(vif_entry, RWNX_TXQ_STOP_P2P_ABSENCE);
	}
	GLOBAL_INT_RESTORE();

	return 0;
}
#endif

#if CONFIG_RWNX_SW_TXQ
static inline int rwnx_rx_twt_ps_change_ind(struct ke_msg *msg)
{
	struct mm_twt_ps_change_ind *ind  = (struct mm_twt_ps_change_ind *)msg->param;
	void *vif_entry = NULL;

	GLOBAL_INT_DECLARATION();

	// RWNX_DBG(RWNX_FN_ENTRY_STR);
	GLOBAL_INT_DISABLE();


	if (ind->vif_index != INVALID_VIF_IDX)
		vif_entry = mac_vif_mgmt_get_entry(ind->vif_index);

	if (!vif_entry || !mac_vif_mgmt_get_active(vif_entry)) {
		GLOBAL_INT_RESTORE();
		return 1;
	}

	if (ind->twt_ps_state) {
		// Stop TX queues for provided VIF
		RWNX_LOGV("TWT PS stop! state %d\n",ind->twt_ps_state);
		rwnx_txq_vif_stop(vif_entry, RWNX_TXQ_STOP_TWT_PS);
	} else {
		// Start TX queues for provided VIF
		RWNX_LOGV("TWT PS start! state %d\n",ind->twt_ps_state);
		rwnx_txq_vif_start(vif_entry, RWNX_TXQ_STOP_TWT_PS);
	}
	GLOBAL_INT_RESTORE();

	return 0;
}
#endif

void rwm_msdu_twt_ps_change_ind_handler(void *msg)
{
	struct ke_msg *msg_ptr = (struct ke_msg *)msg;
	struct mm_twt_ps_change_ind *ind;

	if(!msg_ptr || !msg_ptr->param)
		return;

	ind = (struct mm_twt_ps_change_ind *)msg_ptr->param;

	if (ind->twt_ps_state == 0)
	{
#if CONFIG_TX_BUFING
		rwm_trigger_tx_bufing_stop(TX_BUFING_SRC_TWT, ind->vif_index);
#endif
	}
	else if (ind->twt_ps_state == 1)
	{
#if CONFIG_TX_BUFING
		rwm_trigger_tx_bufing_start(TX_BUFING_SRC_TWT, ind->vif_index);
#endif
	}

