JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
}

void *rwnx_get_rlk_info_results(void)
{
	void *ptr;

	ptr = &wifi_rlk_info;

	return ptr;
}

void rwnx_flush_rlk_info_results(void)
{
	uint32_t rlk_start = wifi_rlk_info.wifi_rlk_start;

	os_memset(&wifi_rlk_info, 0x0, sizeof(wifi_rlk_base_info_t));
	wifi_rlk_info.wifi_rlk_start = rlk_start;
}

void rwnx_chan_survey_ind_handler(void *msg)
{
	struct ke_msg *msg_ptr = (struct ke_msg *)msg;
	struct mm_channel_survey_ind *ind;
	int8_t chan_idx = 0xFF;

	if(!msg_ptr || !msg_ptr->param)
		return;

	ind = (struct mm_channel_survey_ind *)msg_ptr->param;

	RWNX_LOGV("chan_survey busy %d ms time %d ms noise %d freq %d\r\n",
			 ind->chan_time_busy_ms,ind->chan_time_ms,ind->noise_dbm,ind->freq);

	if((ind->freq < CHANNEL_ONE_FREQUENCY_FOR_2_4G) || (ind->freq >= CHANNEL_FOURTEEN_FREQUENCY_FOR_2_4G))
	{
		return;
	}

	chan_idx = (ind->freq - CHANNEL_ONE_FREQUENCY_FOR_2_4G) / 5;
	RWNX_LOGV("%s chan_idx %d\r\n",__func__,chan_idx);

	if((chan_idx != 0xFF) && (chan_idx < MAX_CHANNEL_SUPPORT_INDEX_FOR_2_4G))
	{
		wifi_rlk_info.chan[chan_idx].freq = ind->freq;
		wifi_rlk_info.chan[chan_idx].noise_dbm = ind->noise_dbm;
		wifi_rlk_info.chan[chan_idx].chan_time_ms = ind->chan_time_ms;
		wifi_rlk_info.chan[chan_idx].chan_time_busy_ms = ind->chan_time_busy_ms;
	}
}

void rwnx_set_wifi_rlk_start(uint32_t start)
{
	wifi_rlk_info.wifi_rlk_start = start;
	RWNX_LOGV("%s start %d\r\n",__func__,wifi_rlk_info.wifi_rlk_start);
}

uint32_t rwnx_get_wifi_rlk_start(void)
{
	/* The authority's RWNX_LOGV here is dropped, not silenced by config.
	 *
	 * Upstream this call site prints nothing: the authority compiles BK_LOGV
	 * out at log level 3, and RWNX_LOGV is BK_LOGV (rwnx_defs.h:286).  Our
	 * hal_port/include/components/log.h deliberately routes V to LOG_DEBUG instead,
	 * because two evidence channels this bring-up reads off the UART travel
	 * through it -- `[hitf] add key`/`add hw key` (hostapd_intf.c:413,418, the
	 * proof that PTK/GTK reached the MAC) and the wpa 4-way state trace.
	 *
	 * That override turned this particular line into noise.  This is a getter
	 * called once per packet from rwnx_txq.c:819 and :859, so it emitted 173
	 * lines in a single connect capture (/tmp/0910-vela-1.log) and completely
	 * buried the tail of the log.
	 *
	 * Removing it therefore converges on authority *behaviour* -- silence here
	 * -- while keeping the channels the override exists for.  The identically
	 * worded RWNX_LOGV in rwnx_set_wifi_rlk_start() above is kept: it fires only
	 * when the flag actually changes, which is signal rather than noise. */

	return wifi_rlk_info.wifi_rlk_start;
}

void rwnx_wifi_rlk_trigger_scan_process(void)
{
	wifi_rlk_scan_cfm_cb_t cfm_cb = wifi_rlk_scan_get_register_cfm_cb();

	if (cfm_cb)
		cfm_cb();
}

//TODO remove old event handler
void rwnx_handle_recv_msg(struct ke_msg *rx_msg)
{
	//uint32_t param;
	//FUNC_1PARAM_PTR fn = bk_wlan_get_status_cb();
	//wifi_event_sta_disconnected_t sta_disconnected = {0};
	//wifi_linkstate_reason_t info;

	switch (rx_msg->id) {

	/**************************************************************************/
	/*                          scan_hdlrs                                    */
	/**************************************************************************/
	case SCANU_START_CFM:
		/* scan complete */
		bk7258_scan_diag_record(BK7258_SCAN_DIAG_LMAC_COMPLETE);
		if (scan_rst_set_ptr) {
			/* scan activity has valid result*/
			resultful_scan_cfm = 1;
		}

		#if CONFIG_WIFI_SCAN_COUNTRY_CODE
		site_survey_cc = false;
		#endif // CONFIG_WIFI_SCAN_COUNTRY_CODE

		sort_scan_result(scan_rst_set_ptr);

		if (rwnx_get_wifi_rlk_start())
		{
			rwnx_wifi_rlk_trigger_scan_process();
		}
		else {
			wpa_ctrl_event(WPA_CTRL_EVENT_SCAN_RESULTS, NULL);
		}

		break;

	case SCANU_RESULT_IND:
		/* scan result indication */
		if (resultful_scan_cfm && scan_rst_set_ptr) {
			sr_flush_scan_results(scan_rst_set_ptr);

			scan_rst_set_ptr = 0;
			resultful_scan_cfm = 0;
		}

		if (0 == scan_rst_set_ptr) {
			scan_rst_set_ptr = (SCAN_RST_UPLOAD_T *)sr_malloc_shell();
			if (scan_rst_set_ptr) {
				scan_rst_set_ptr->scanu_num = 0;
				scan_rst_set_ptr->res = (SCAN_RST_ITEM_PTR *)&scan_rst_set_ptr[1];
				mhdr_scanu_result_ind(scan_rst_set_ptr, rx_msg, rx_msg->param_len);
			} else
				RWNX_LOGD("scan_rst_set_ptr malloc fail\r\n");
		} else {
			mhdr_scanu_result_ind(scan_rst_set_ptr, rx_msg, rx_msg->param_len);
		}

		break;

	case SCANU_JOIN_IND:
		break;

		/**************************************************************************/
		/*							sm_hdlrs								      */
		/**************************************************************************/
	case SM_CONNECT_IND:
		/* connect indication */
		if (scan_rst_set_ptr) {
			sr_flush_scan_results(scan_rst_set_ptr);

			scan_rst_set_ptr = 0;
			resultful_scan_cfm = 0;
		}

		mhdr_connect_ind(rx_msg, rx_msg->param_len);
		break;

#if defined(CONFIG_PMF)
	case RXU_MGT_IND:
		// STA mgmt: FIXME: AP may sends RXU_MGT_IND?
		mhdr_mgmt_ind(rx_msg, rx_msg->param_len);
		break;
#endif

	case SM_DISCONNECT_IND: {
		struct ke_msg *msg_ptr;
		struct sm_disconnect_ind *ind;

		msg_ptr = (struct ke_msg *)rx_msg;
		ind = (struct sm_disconnect_ind *)msg_ptr->param;

		RWNX_LOGV("disconnect\r\n");

#if defined(CONFIG_IEEE80211R) || defined(CONFIG_WNM)
				if (!ind->reassoc)
#endif
				{
#if NX_VERSION > NX_VERSION_PACK(6, 22, 0, 0)
					rwnx_misc_disconnect_ind(ind);
#endif
					wpa_ctrl_event_copy(WPA_CTRL_EVENT_DISCONNECT_IND, ind, sizeof(*ind));

#if (!CONFIG_SOC_BK7271)
					extern UINT32 rwnx_sys_is_enable_hw_tpc(void);
					if (rwnx_sys_is_enable_hw_tpc() == 0)
						rwnx_cal_set_txpwr(20, 11);
#endif
				}
			}	break;

	case SM_BEACON_LOSE_IND: {
		/* when beacon loss, umac will start disconnect procedure, and another ke_msg will uploaded */
#if 0
		info.state = WIFI_LINKSTATE_STA_DISCONNECTED;
		info.reason_code = WIFI_REASON_BEACON_LOST;
		mhdr_set_station_status(info);

#if !CONFIG_DISABLE_DEPRECIATED_WIFI_API
		if (fn) {
			param = WIFI_LINKSTATE_STA_DISCONNECTED;
			(*fn)(&param);
		}
#endif
		sta_disconnected.disconnect_reason = info.reason_code;
		sta_disconnected.local_generated = true;
		BK_LOG_ON_ERR(bk_event_post(EVENT_MOD_WIFI, EVENT_WIFI_STA_DISCONNECTED,
					  &sta_disconnected, sizeof(sta_disconnected), BEKEN_NEVER_TIMEOUT));
#if (CONFIG_RF_POLICY_WIFI_REQ)
		wifi_station_status_event_notice(0, WIFI_LINKSTATE_STA_DISCONNECTED);
#endif
#endif
	}
	break;


	/**************************************************************************/
	/*							me_hdlrs									  */
	/**************************************************************************/
	case ME_TKIP_MIC_FAILURE_IND:
		break;

	/**************************************************************************/
	/*							mm_hdlrs									  */
	/**************************************************************************/
	case MM_TAGGED_PARAM_CHANGE: {
		RWNX_LOGV("MM_TAGGED_PARAM_CHANGE\r\n");
	}
		break;

