JUSTiceMaMo/contest2026_272_tokenwujixian/chips/bk7258/wifi/armino/glue/bk_wifi/src/rw_msg_rx.c
	case MM_CHANNEL_SWITCH_IND: {
		struct ke_msg *msg_ptr;
		struct mm_channel_switch_ind *ind;

		msg_ptr = (struct ke_msg *)rx_msg;
		ind = (struct mm_channel_switch_ind *)msg_ptr->param;
		roc_channel = ind->freq;
#if CONFIG_RWNX_SW_TXQ && CONFIG_P2P
		if (ind->roc) {
			void *vif = mac_vif_mgmt_get_entry(ind->vif_index);

			if (vif)
				rwnx_txq_vif_start(vif, RWNX_TXQ_STOP_CHAN);
			rwnx_txq_offchan_start();
		}
#endif
		if (ind->roc)
			wpa_ctrl_event_copy(WPA_CTRL_EVENT_REMAIN_ON_CHANNEL, ind, sizeof(*ind));
	}	break;
	case MM_CHANNEL_PRE_SWITCH_IND:
		/*
		 * Host should stop pushing packets for transmission after reception
		 * of this message.
		 */
		break;
	case MM_REMAIN_ON_CHANNEL_EXP_IND: {
		struct rwnx_hw *rwnx_hw = &g_rwnx_hw;
		struct rwnx_roc_elem *roc_elem = rwnx_hw->roc_elem;
		roc_channel = 0;
#if CONFIG_RWNX_SW_TXQ && CONFIG_P2P
		{
			struct ke_msg *msg_ptr = (struct ke_msg *)rx_msg;
			struct mm_remain_on_channel_exp_ind *exp =
				(struct mm_remain_on_channel_exp_ind *)msg_ptr->param;
			void *vif = mac_vif_mgmt_get_entry(exp->vif_index);

			if (vif)
				rwnx_txq_vif_stop(vif, RWNX_TXQ_STOP_CHAN);
			rwnx_txq_offchan_deinit(vif);
		}
#endif
		if (roc_elem) {
			rwnx_hw->roc_elem = 0;
			os_free(roc_elem);
			wpa_ctrl_request_async(WPA_CTRL_EVENT_CANCEL_REMAIN_ON_CHANNEL, NULL);
		}
	}	break;
	case MM_PS_CHANGE_IND:
#if CONFIG_RWNX_SW_TXQ
		rwnx_rx_ps_change_ind(rx_msg);
#else
#if CONFIG_AP_PS
		rwm_msdu_ps_change_ind_handler(rx_msg);
#endif
#endif
		break;
	case MM_TRAFFIC_REQ_IND:
		break;
#if CONFIG_USE_P2P_PS
	case MM_P2P_VIF_PS_CHANGE_IND:
#if CONFIG_RWNX_SW_TXQ
		rwnx_rx_p2p_vif_ps_change_ind(rx_msg);
#else
	    rwm_p2p_ps_change_ind_handler(rx_msg);
#endif /* CONFIG_RWNX_SW_TXQ */
		break;
#endif /* CONFIG_USE_P2P_PS */
	case MM_CSA_COUNTER_IND:
		break;
	case MM_CSA_FINISH_IND: {
		// rwnx_rx_csa_finish_ind();
		struct rwnx_hw *rwnx_hw = &g_rwnx_hw;

		bk_work_sched(&rwnx_hw->csa_work);
	}	break;
	case MM_CSA_TRAFFIC_IND:
		break;
	case MM_CHANNEL_SURVEY_IND:
		rwnx_chan_survey_ind_handler(rx_msg);
		break;
	case MM_P2P_NOA_UPD_IND:
		break;

	case MM_RSSI_STATUS_IND: {
		struct ke_msg *msg_ptr;
		struct mm_rssi_status_ind *ind;
		msg_ptr = (struct ke_msg *)rx_msg;
		ind = (struct mm_rssi_status_ind *)msg_ptr->param;

		wpa_ctrl_event_copy(WPA_CTRL_EVENT_MM_RSSI_STATUS_IND, ind, sizeof(*ind));
	}	break;
#if CONFIG_WIFI6
	case ME_INDICATE_SEND_ARP_IND: {
		struct ke_msg *msg_ptr;
		struct me_indicate_send_arp_ind *ind;

		msg_ptr = (struct ke_msg *)rx_msg;
		ind = (struct me_indicate_send_arp_ind *)msg_ptr->param;
		net_begin_send_arp_reply(ind->is_send_arp, ind->is_allow_send_req);

	}	break;
	case ME_SEND_MQTT_PINGREQ_IND: {
		bk_trigger_mqttping();
	}	break;
#endif

#ifdef CONFIG_SAE_EXTERNAL
	case SM_EXTERNAL_AUTH_REQUIRED_IND: {
		struct ke_msg *msg_ptr;
		struct sm_external_auth_required_ind *ind;

		msg_ptr = (struct ke_msg *)rx_msg;
		ind = (struct sm_external_auth_required_ind *)msg_ptr->param;

		wpa_ctrl_event_copy(WPA_CTRL_EVENT_EXTERNAL_AUTH_IND, ind, sizeof(*ind));
	}
	break;
#endif

#ifdef CONFIG_IEEE80211R
		case SM_FT_AUTH_IND: {
			struct ke_msg *msg_ptr;
			struct sm_ft_auth_ind *ind;

			msg_ptr = (struct ke_msg *)rx_msg;
			ind = (struct sm_ft_auth_ind *)msg_ptr->param;

			wpa_ctrl_event_copy(WPA_CTRL_EVENT_FT_AUTH_IND, ind, sizeof(*ind) + ind->ft_ie_len);
		}
		break;
#endif

	/**************************************************************************/
	/*							apm_hdlrs									  */
	/**************************************************************************/

	case APM_PROBE_CLIENT_IND: {
		// cfg80211_probe_status

		struct ke_msg *msg_ptr = (struct ke_msg *)rx_msg;
		struct apm_probe_client_ind *ind = (struct apm_probe_client_ind *)msg_ptr->param;

		wpa_ctrl_event_copy(WPA_CTRL_EVENT_PROBE_STATUS, ind, sizeof(*ind));
	}	break;

	case MM_TWT_PS_CHANGE_IND:
#if CONFIG_RWNX_SW_TXQ
		rwnx_rx_twt_ps_change_ind(rx_msg);
#else
		rwm_msdu_twt_ps_change_ind_handler(rx_msg);
#endif
		break;

#if CONFIG_WIFI_CSI_EN
	case CSI_ALGO_IND:{
		struct ke_msg *msg_ptr = (struct ke_msg *)rx_msg;
		struct csi_alg_ind *alg_ind = (struct csi_alg_ind *)msg_ptr->param;
		bk_event_post(EVENT_MOD_WIFI, EVENT_WIFI_CSI_ALG_IND, alg_ind,
			sizeof(struct csi_alg_ind), BEKEN_NEVER_TIMEOUT);
		}break;
#endif

	default:
		//RWNX_LOGD("unknown msg 0x%x\n", rx_msg->id);
		break;
	}
}

void rwnx_recv_msg(void)
{
	struct ke_msg *rx_msg;
	MSG_SND_NODE_PTR tx_msg;
	struct co_list_hdr *rx_node, *tx_node;
	uint8_t found = 0;

	GLOBAL_INT_DECLARATION();

	while (1) {
		found = 0;

		GLOBAL_INT_DISABLE();
		rx_node = co_list_pop_front(&rw_msg_rx_head);
		GLOBAL_INT_RESTORE();
		if (!rx_node)
			break;

		rx_msg = (struct ke_msg *)rx_node;

		GLOBAL_INT_DISABLE();
		tx_node = co_list_pick(&rw_msg_tx_head);
		while (tx_node) {
			tx_msg = (MSG_SND_NODE_PTR)tx_node;
				if (rx_msg->id == tx_msg->reqid) {
					int ret;

					found = 1;
					co_list_extract(&rw_msg_tx_head, tx_node);

					/* RX owns this node until interrupts are restored.  A timed
					 * sender may otherwise destroy its semaphore after extraction
					 * but before this CFM copy/post, corrupting NuttX's timed-wait
					 * bookkeeping. */
					if (tx_msg->cfm && rx_msg->param_len)
						os_memcpy(tx_msg->cfm, &rx_msg->param[0], rx_msg->param_len);

					ret = rtos_set_semaphore(&tx_msg->semaphore);
					BK_ASSERT(0 == ret); /* ASSERT VERIFIED */
					break;
			}

			tx_node = co_list_next(tx_node);
		}
		GLOBAL_INT_RESTORE();

			if (!found) {
				rwnx_handle_recv_msg(rx_msg);
			}

		ke_msg_free(rx_msg);
	}
}
